In [1]:
import numpy as np
import pandas as pd

In [2]:
print("hello, starting venv")

hello, starting venv

a list

not an erray
https://www.pythoncentral.io/the-difference-between-a-list-and-an-array/

In [3]:
labels=['a','b','c']

In [8]:
labels

['a', 'b', 'c']

In [3]:
my_data =[10,20,30 ]
arr=np.array(my_data)

array via np wrapper

In [4]:
arr2=np.array(my_data)
arr2

array([10, 20, 30])

In [11]:
arr2=arr2*2
arr2

array([20, 40, 60])

In [10]:
d={'a':10,'b':20,'c':30}
d

{'a': 10, 'b': 20, 'c': 30}

pd series concepts

In [6]:
pd.Series(my_data,labels)

NameError: name 'labels' is not defined

In [17]:
#dictionary to series.. 
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [18]:
#list to  Series
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [20]:
#series can hold any data type , for example a list of strings as Data Points.. 
#series is a bunch of data points .
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [22]:
#series can hold set of  pointer to functions, like  C , very cool
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [7]:
#series  working  ,  ad hoc data and lablels
ser1 =pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [24]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [8]:
ser2 =pd.Series([1,2,4,5],['USA','Germany','Italy','Japan'])
ser2['USA']

1

In [27]:
#operations with 2 seres... if same index structure, then  operations are allowed
ser1+ser2

Germany    4.0
Italy      NaN
Japan      9.0
USA        2.0
USSR       NaN
dtype: float64

In [12]:
#on to dataframes- SETUP

# randn returns  N dim space  of random numbmers
from numpy.random import randn
np.random.seed(101)

In [13]:
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [14]:
randn(5,4,3,5)

array([[[[ 3.02665449e-01,  1.69372293e+00, -1.70608593e+00,
          -1.15911942e+00, -1.34840721e-01],
         [ 3.90527843e-01,  1.66904636e-01,  1.84501859e-01,
           8.07705914e-01,  7.29596753e-02],
         [ 6.38787013e-01,  3.29646299e-01, -4.97104023e-01,
          -7.54069701e-01, -9.43406403e-01]],

        [[ 4.84751647e-01, -1.16773316e-01,  1.90175480e+00,
           2.38126959e-01,  1.99665229e+00],
         [-9.93263500e-01,  1.96799505e-01, -1.13664459e+00,
           3.66479606e-04,  1.02598415e+00],
         [-1.56597904e-01, -3.15791439e-02,  6.49825833e-01,
           2.15484644e+00, -6.10258856e-01]],

        [[-7.55325340e-01, -3.46418504e-01,  1.47026771e-01,
          -4.79448039e-01,  5.58769406e-01],
         [ 1.02481028e+00, -9.25874259e-01,  1.86286414e+00,
          -1.13381716e+00,  6.10477908e-01],
         [ 3.86030312e-01,  2.08401853e+00, -3.76518675e-01,
           2.30336344e-01,  6.81209293e-01]],

        [[ 1.03512507e+00, -3.11604815e-02,  1.93993231e+00,
          -1.00518692e+00, -7.41789705e-01],
         [ 1.87124522e-01, -7.32845148e-01, -1.38292010e+00,
           1.48249550e+00,  9.61458156e-01],
         [-2.14121229e+00,  9.92573453e-01,  1.19224064e+00,
          -1.04677954e+00,  1.29276458e+00]]],


       [[[-1.46751402e+00, -4.94095358e-01, -1.62534735e-01,
           4.85808737e-01,  3.92488811e-01],
         [ 2.21490685e-01, -8.55196041e-01,  1.54199041e+00,
           6.66319321e-01, -5.38234626e-01],
         [-5.68581361e-01,  1.40733825e+00,  6.41805511e-01,
          -9.05099902e-01, -3.91156627e-01]],

        [[ 1.02829316e+00, -1.97260510e+00, -8.66885035e-01,
           7.20787599e-01, -1.22308204e+00],
         [ 1.60677986e+00, -1.11570997e+00, -1.38537856e+00,
          -1.32966006e+00,  4.14599429e-02],
         [-4.11055403e-01, -7.71328605e-01,  1.10477411e-01,
          -8.04651512e-01,  2.53548041e-01]],

        [[ 6.49147746e-01,  3.58940525e-01, -1.08047146e+00,
           9.02397757e-01,  1.61781188e-01],
         [ 8.33029324e-01,  9.75719680e-01, -3.88238700e-01,
           7.83316051e-01, -7.08953738e-01],
         [ 5.86847295e-01, -1.62134783e+00,  6.77535114e-01,
           2.61054803e-02, -1.67828366e+00]],

        [[ 3.33973101e-01, -5.32470526e-01,  2.11772738e+00,
           1.97523986e-01,  2.30298727e+00],
         [ 7.29023732e-01, -8.63091269e-01,  3.05631512e-01,
           2.43177614e-01,  8.64164878e-01],
         [-1.56093145e+00, -2.51896952e-01, -5.78120259e-01,
           2.36995630e-01,  2.00780469e-01]]],


       [[[ 3.27844740e-01,  6.74485187e-01, -1.74056541e-01,
           7.80139715e-01, -3.83258131e-01],
         [-4.09318484e-01,  3.43539187e-01,  1.96275316e-01,
          -9.82775997e-01,  2.23155524e+00],
         [-9.71392566e-01, -1.52233287e+00,  1.13370299e+00,
           5.28186734e-01,  3.93460760e-01]],

        [[-6.30506633e-01, -1.39828968e+00, -2.19310716e-01,
          -4.56764797e-02,  1.24209903e-02],
         [ 9.36279847e-02,  1.24081261e+00, -1.09769302e+00,
          -1.90800882e+00, -3.80103502e-01],
         [-1.66605918e+00, -2.73699460e+00,  1.52256211e+00,
           1.78009091e-01, -6.26805405e-01]],

        [[-3.91088967e-01,  1.74347695e+00,  1.13001805e+00,
           8.97796311e-01,  3.30865620e-01],
         [-1.06304889e+00, -1.25380801e-01, -9.45588125e-01,
           2.02954418e+00, -1.04635839e+00],
         [-1.30648231e+00, -1.63292400e+00,  8.02129370e-01,
          -1.66753678e+00,  6.08857292e-01]],

        [[ 2.86472988e-01, -2.05792298e-01,  2.49399019e+00,
          -5.47259888e-01,  4.96726954e-01],
         [-1.23561426e+00, -7.98427961e-01,  7.54121433e-01,
          -7.72040644e-01, -3.44316370e-02],
         [ 6.88408424e-01,  8.15233578e-02, -4.15191116e-01,
           5.36614579e-02, -2.11511310e+00]]],


       [[[-2.79510215e-01,  1.06271042e+00,  1.75201442e+00,
           6.95546725e-01,  1.53660834e-01],
         [ 1.67638244e-01, -7.65930075e-01,  9.62299170e-01,
           9.02825859e-01, -5.37909157e-01],
         [-1.54967110e+00,  4.35252922e-01,  1.25990369e+00,
          -4.47898352e-01,  2.66206779e-01]],

        [[ 4.12580161e-01,  9.88772845e-01,  5.13832729e-01,
          -9.28204832e-01,  8.46903898e-01],
         [-2.98435744e-01,  2.91414757e-02,  8.89030884e-01,
          -1.83926086e+00,  8.63595602e-01],
         [-1.07659050e+00, -5.80382983e-01,  1.20902728e+00,
           1.20174403e+00, -8.20463164e-01]],

        [[-1.02957716e+00, -1.52485554e+00, -8.54859901e-01,
           1.60281554e+00,  1.85478987e-01],
         [-9.94018292e-01, -1.31906137e-01, -1.33509173e+00,
          -8.92984417e-02,  6.98566404e-01],
         [-1.40912568e+00,  8.70907017e-01,  1.58581239e+00,
           9.29657841e-01, -5.50876003e-01]],

        [[ 9.42044977e-01, -9.75349350e-01, -1.05485060e+00,
           2.16542112e+00, -1.26724018e+00],
         [-8.02843171e-01, -2.53479383e-01,  9.06987440e-02,
           1.32171535e+00,  7.94128506e-01],
         [ 1.35971198e+00,  7.71970039e-01,  2.94216627e-01,
          -1.39151906e+00,  1.47486471e-01]]],


       [[[-7.29466337e-01, -7.20109748e-01, -2.85256766e-01,
           2.09053915e+00,  1.00405615e+00],
         [ 1.03191586e+00, -1.08111828e+00, -3.54961089e-04,
          -2.19881548e-01,  2.92795131e-01],
         [ 8.34354522e-01, -1.40431831e-01,  1.19144962e-01,
           6.65714586e-01,  4.07586450e-01]],

        [[ 8.07842743e-01, -2.73646445e+00, -9.85152855e-01,
          -1.55275750e-01, -1.01322801e+00],
         [-1.08743589e+00, -2.56776692e+00,  6.61029198e-01,
          -3.32920800e-01, -9.28602274e-01],
         [ 1.71595017e+00, -4.68756286e-01,  8.60097036e-01,
           2.30087044e-01,  6.18657993e-01]],

        [[-2.05256292e+00, -1.66646116e-01, -4.45872783e-01,
           6.85873765e-01,  2.78500967e+00],
         [ 1.52375046e+00,  1.29022993e+00, -1.47831936e+00,
           2.14234194e-01, -2.40509948e-01],
         [-1.42094948e+00,  3.21659585e-01,  1.00732413e+00,
           3.29783652e-01,  9.20525172e-01]],

        [[ 1.34913752e+00, -3.77861493e-01,  1.95541989e+00,
          -8.58304211e-01, -2.22210245e-01],
         [-5.12028637e-02, -4.39128023e-01, -1.50104124e+00,
           1.05835693e+00,  1.85496716e+00],
         [ 5.02250337e-01,  1.14580877e-01, -3.68487497e-01,
           4.59343068e-01,  5.85512683e-01]]]])

In [15]:
randn(1,3)
pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>-0.031927</td>
      <td>1.407189</td>
      <td>0.060971</td>
      <td>-1.542393</td>
    </tr>
    <tr>
      <th>B</th>
      <td>-0.821110</td>
      <td>-1.599171</td>
      <td>-2.068836</td>
      <td>1.509747</td>
    </tr>
    <tr>
      <th>C</th>
      <td>0.174683</td>
      <td>0.463428</td>
      <td>-2.206442</td>
      <td>0.544159</td>
    </tr>
    <tr>
      <th>D</th>
      <td>0.698296</td>
      <td>1.252944</td>
      <td>-1.048347</td>
      <td>-1.281320</td>
    </tr>
    <tr>
      <th>E</th>
      <td>1.276731</td>
      <td>0.645132</td>
      <td>-0.297637</td>
      <td>0.755742</td>
    </tr>
  </tbody>
</table>
</div>

In [40]:
randn(1,10)

array([[ 0.50382575,  0.65111795, -0.31931804, -0.84807698,  0.60596535,
        -2.01816824,  0.74012206,  0.52881349, -0.58900053,  0.18869531]])

In [16]:
df1=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [47]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>0.992573</td>
      <td>1.192241</td>
      <td>-1.046780</td>
      <td>1.292765</td>
    </tr>
    <tr>
      <th>B</th>
      <td>-1.467514</td>
      <td>-0.494095</td>
      <td>-0.162535</td>
      <td>0.485809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>0.392489</td>
      <td>0.221491</td>
      <td>-0.855196</td>
      <td>1.541990</td>
    </tr>
    <tr>
      <th>D</th>
      <td>0.666319</td>
      <td>-0.538235</td>
      <td>-0.568581</td>
      <td>1.407338</td>
    </tr>
    <tr>
      <th>E</th>
      <td>0.641806</td>
      <td>-0.905100</td>
      <td>-0.391157</td>
      <td>1.028293</td>
    </tr>
  </tbody>
</table>
</div>

In [49]:
#how much ram 

df1.memory_usage()

Index    40
W        40
X        40
Y        40
Z        40
dtype: int64

In [51]:
#df is a bunch of series that share an index (in 2D case)

df1['W']

A    0.992573
B   -1.467514
C    0.392489
D    0.666319
E    0.641806
Name: W, dtype: float64

In [52]:
type(df1['W'])

pandas.core.series.Series

In [53]:
type(df1[['W','Z']])

pandas.core.frame.DataFrame

In [37]:
#select columns  
df1[['W','Z']]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>-1.314142</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>E</th>
      <td>-0.220208</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [73]:
#really like a spreadsheet object  
df1['calcd']=df1['W']*100+df1['X']*100

In [74]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
      <th>calcd</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>0.992573</td>
      <td>1.192241</td>
      <td>-1.046780</td>
      <td>1.292765</td>
      <td>218.481409</td>
    </tr>
    <tr>
      <th>B</th>
      <td>-1.467514</td>
      <td>-0.494095</td>
      <td>-0.162535</td>
      <td>0.485809</td>
      <td>-196.160938</td>
    </tr>
    <tr>
      <th>C</th>
      <td>0.392489</td>
      <td>0.221491</td>
      <td>-0.855196</td>
      <td>1.541990</td>
      <td>61.397950</td>
    </tr>
    <tr>
      <th>D</th>
      <td>0.666319</td>
      <td>-0.538235</td>
      <td>-0.568581</td>
      <td>1.407338</td>
      <td>12.808470</td>
    </tr>
    <tr>
      <th>E</th>
      <td>0.641806</td>
      <td>-0.905100</td>
      <td>-0.391157</td>
      <td>1.028293</td>
      <td>-26.329439</td>
    </tr>
  </tbody>
</table>
</div>

In [38]:
#very cool selectors -  Select  ROWS
df1.loc[ ['A','C'],['X','Y']]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>X</th>
      <th>Y</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>0.307046</td>
      <td>0.529927</td>
    </tr>
    <tr>
      <th>C</th>
      <td>2.601240</td>
      <td>-0.612552</td>
    </tr>
  </tbody>
</table>
</div>

In [83]:
#  by index numbers, indexing starts at 0  
df1.iloc[[0,2],[1,2]]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>X</th>
      <th>Y</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.192241</td>
      <td>-1.046780</td>
    </tr>
    <tr>
      <th>C</th>
      <td>0.221491</td>
      <td>-0.855196</td>
    </tr>
  </tbody>
</table>
</div>

In [30]:
df1.shape

(5, 4)

In [19]:
print("resume")

resume

In [20]:
df

NameError: name 'df' is not defined

In [21]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>E</th>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [23]:
# apply too all values in dataframe - 
df1 > 1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>True</td>
      <td>False</td>
      <td>False</td>
      <td>False</td>
    </tr>
    <tr>
      <th>B</th>
      <td>False</td>
      <td>False</td>
      <td>False</td>
      <td>False</td>
    </tr>
    <tr>
      <th>C</th>
      <td>False</td>
      <td>True</td>
      <td>False</td>
      <td>False</td>
    </tr>
    <tr>
      <th>D</th>
      <td>True</td>
      <td>True</td>
      <td>False</td>
      <td>False</td>
    </tr>
    <tr>
      <th>E</th>
      <td>False</td>
      <td>False</td>
      <td>False</td>
      <td>False</td>
    </tr>
  </tbody>
</table>
</div>

In [24]:
#apply boolean selector  
df1[df1>1]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>B</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>C</th>
      <td>NaN</td>
      <td>2.60124</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.79899</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>E</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [25]:
df1[df1>0.5]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>NaN</td>
      <td>0.529927</td>
      <td>0.94012</td>
    </tr>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>C</th>
      <td>NaN</td>
      <td>2.60124</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.79899</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>E</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [27]:
#conditional against  a column, returnsa  series 
df1['W']>1

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [28]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>E</th>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [40]:
df1.loc['B']

W    0.746221
X   -0.141266
Y    0.085529
Z   -1.883809
Name: B, dtype: float64

In [45]:
#select  twp roles   
df1.loc[['B','C']]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
  </tbody>
</table>
</div>

In [46]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>E</th>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [31]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>E</th>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [51]:
df1.loc['A']

W    1.758122
X    0.307046
Y    0.529927
Z    0.940120
Name: A, dtype: float64

In [53]:
df1.loc['A']> 0.5

W     True
X    False
Y     True
Z     True
Name: A, dtype: bool

In [54]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>A</th>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>B</th>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>C</th>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>E</th>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [62]:
df1 [ (df1['W']>0.5) &  (df1['Y'] < 0) ]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>D</th>
      <td>1.350046</td>
      <td>1.79899</td>
      <td>-1.312854</td>
      <td>0.03359</td>
    </tr>
  </tbody>
</table>
</div>

In [63]:
df1.reset_index()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>1</th>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>2</th>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>3</th>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>4</th>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [64]:
df1.reset_index(inplace=True)

In [65]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>1</th>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>2</th>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>3</th>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>4</th>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [66]:
states="NY NJ CT MA PA".split()

In [67]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>1</th>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>2</th>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>3</th>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>4</th>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [70]:
#add a  column  
df1['States']=states

In [69]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
      <th>States</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
      <td>NY</td>
    </tr>
    <tr>
      <th>1</th>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
      <td>NJ</td>
    </tr>
    <tr>
      <th>2</th>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
      <td>CT</td>
    </tr>
    <tr>
      <th>3</th>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
      <td>MA</td>
    </tr>
    <tr>
      <th>4</th>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
      <td>PA</td>
    </tr>
  </tbody>
</table>
</div>

In [71]:
df1.reset_index()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>level_0</th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
      <th>States</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
      <td>NY</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
      <td>NJ</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2</td>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
      <td>CT</td>
    </tr>
    <tr>
      <th>3</th>
      <td>3</td>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
      <td>MA</td>
    </tr>
    <tr>
      <th>4</th>
      <td>4</td>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
      <td>PA</td>
    </tr>
  </tbody>
</table>
</div>

In [72]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
      <th>States</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
      <td>NY</td>
    </tr>
    <tr>
      <th>1</th>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
      <td>NJ</td>
    </tr>
    <tr>
      <th>2</th>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
      <td>CT</td>
    </tr>
    <tr>
      <th>3</th>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
      <td>MA</td>
    </tr>
    <tr>
      <th>4</th>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
      <td>PA</td>
    </tr>
  </tbody>
</table>
</div>

In [75]:
df1.set_index('States',inplace=True)

In [76]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
    <tr>
      <th>States</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>NY</th>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>NJ</th>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>CT</th>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>MA</th>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>PA</th>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>

In [89]:
df1.loc['NY']

index           A
W         1.75812
X        0.307046
Y        0.529927
Z         0.94012
Name: NY, dtype: object

In [90]:
df1['index']

States
NY    A
NJ    B
CT    C
MA    D
PA    E
Name: index, dtype: object

In [91]:
df1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>index</th>
      <th>W</th>
      <th>X</th>
      <th>Y</th>
      <th>Z</th>
    </tr>
    <tr>
      <th>States</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>NY</th>
      <td>A</td>
      <td>1.758122</td>
      <td>0.307046</td>
      <td>0.529927</td>
      <td>0.940120</td>
    </tr>
    <tr>
      <th>NJ</th>
      <td>B</td>
      <td>0.746221</td>
      <td>-0.141266</td>
      <td>0.085529</td>
      <td>-1.883809</td>
    </tr>
    <tr>
      <th>CT</th>
      <td>C</td>
      <td>-1.314142</td>
      <td>2.601240</td>
      <td>-0.612552</td>
      <td>-1.714963</td>
    </tr>
    <tr>
      <th>MA</th>
      <td>D</td>
      <td>1.350046</td>
      <td>1.798990</td>
      <td>-1.312854</td>
      <td>0.033590</td>
    </tr>
    <tr>
      <th>PA</th>
      <td>E</td>
      <td>-0.220208</td>
      <td>-0.308472</td>
      <td>-0.842066</td>
      <td>-0.831162</td>
    </tr>
  </tbody>
</table>
</div>